::::::::::::::::::::::::::::任意值三角函数计算::::::::::::::::::::::::::::::
::用法：call  asin  RetVar=Num                                             ::
::            %1 指定一个变量名，用于存储返回值，运算结果四舍五入         ::
::            %2 指定一个角度用于计算                                     ::
::                                                                        ::
:: 说明：1、函数中的角度单位为度，计算时允许使用任意有效度数；            ::
::       2、计算结果均四舍五入，三角函数精确到 0.0001，反三角函数取整；   ::
::       3、当参数格式不对时将退出码设为2，当使用不在所选函数计算范围的数 ::
::          值时退出码设为1，任何错误都将把用户指定的 retvar 设为 Error。 ::
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
set "%~1=Error"&setlocal enabledelayedexpansion
for /f "eol=-delims=-0123456789." %%a in ("%~2")do exit /b1
for /f "tokens=1,2delims=aceinost." %%a in ("%~20")do 2>nul (set num=%%b0000
set /a "m=(%%a1>>31)*2+1,num=~-%%a*10000+(1!num:~,5!+5)/10,1/^!(num/10001),n=-~-m*90"||exit /b1)
for /f "usebackskip=16" %%a in ("%~f0")do if %num% gtr %%a (
set/an+=m)else for %%a in (!n!)do endlocal&set "%~1=%%a"&exit /b0
87
262
436
610
785
958
1132
1305
1478
1650
1822
1994
2164
2334
2504
2672
2840
3007
3173
3338
3502
3665
3827
3987
4147
4305
4462
4617
4772
4924
5075
5225
5373
5519
5664
5807
5948
6088
6225
6361
6494
6626
6756
6884
7009
7133
7254
7373
7490
7604
7716
7826
7934
8039
8141
8241
8339
8434
8526
8616
8704
8788
8870
8949
9026
9100
9171
9239
9304
9367
9426
9483
9537
9588
9636
9681
9724
9763
9799
9833
9863
9890
9914
9936
9954
9969
9981
9990
9997
10000