:::::::::::::::::::::::::::::日期转天数函数::::::::::::::::::::::::::::
:date2days
:: 用法1：计算从 1970-01-01 到指定日期之间所经过的天数对应的日历日期。
::  call :Date2Days %yy% %mm% %dd% days
::  参数：%1 待转换的年
::        %2 待转换的月，可以以零开头
::        %3 待转换的日，可以以零开头
::        %4 该变量用于接收所经过的天数（可为空）
::
:: 用法2：计算两个日期的天数差值
::  call :Date2Days %y1% %m1% %d1% %y2% %m2% %d2% days
::  参数：%1 待转换的年1
::        %2 待转换的月1，可以以零开头
::        %3 待转换的日1，可以以零开头
::        %4 待转换的年2
::        %5 待转换的月2，可以以零开头
::        %6 待转换的日2，可以以零开头
::        %7 该变量用于接收所经过的天数（可为空）
::
:: 注：可选项若为空，则显示结果到屏幕，否则把结果存储到相应变量中
::
::                                Made by Crlf     http://bbs.bathome.net
:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
setlocal disabledelayedexpansion
set/a days=10%~3%%100-719050+30*(m=10%~2%%100)+m/9*-~m/2+!(m/9)*m/2+!!(m/3)*(!((y=%1)%%4)-!(y%%100)+!(y%%400)-2)+y*365+~-y/4-~-y/100+~-y/400-396-%50/10*!%60
(endlocal&set %7=%days%||set %4=%days%||echo %days%
if %6. neq . call %0 %4 %5 %6 %7 %days%) 2>nul
if /i %0==:date2days exit/b0